#include <stdio.h>
#include <stdlib.h>

int main()
{
    char *menu = "Выбирите пункт меню:\n\
                   1. Классическое умножение матриц\n\
                   2. Алгоритм Виноградова\n\
                   3. Оптимизированный алгоритм Виноградова\n\
                   4. Замер и вывод времени реализованных алгоритмов\n\
                   0. Выход\n\
                   ";
    int choise = -1;
    while (choise != 0)
    {
        if (choise == 1)
            printf("");
    }

    return 0;
}
